AkitaEngineering/ESP32-C3-Reticulum-Node/src/InterfaceManager.cpp
    if (!targetIp || targetIp == INADDR_NONE) {
        DebugSerial.println("! WARN: UDP Target IP is invalid, cannot send.");
        return;
    }

    _udp.beginPacket(targetIp, targetPort);
    size_t sent = _udp.write(packetBuffer, packetLen);
    if (sent != packetLen) { DebugSerial.print("! WARN: UDP write incomplete (sent "); DebugSerial.print(sent); DebugSerial.print("/"); DebugSerial.print(packetLen); DebugSerial.println(" bytes)"); }
    if (!_udp.endPacket()) { DebugSerial.println("! ERROR: UDP endPacket failed!"); }
}

#if METRICS_ENABLED && METRICS_UDP_ENABLED
void InterfaceManager::sendUdpMetrics(const String &json) {
    if (WiFi.status() != WL_CONNECTED) return;
    IPAddress bcast = WiFi.broadcastIP();
    if (!bcast || bcast == INADDR_NONE) return;
    _udp.beginPacket(bcast, METRICS_UDP_PORT);
    _udp.print(json);
    _udp.endPacket();
    LOG_DEBUG("UDP metrics sent to %s:%u", bcast.toString().c_str(), METRICS_UDP_PORT);
}
#endif

// KISS interface sends packaets over dedicated serial link
void InterfaceManager::sendPacketViaSerial(const uint8_t *packetBuffer, size_t packetLen) {
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(packetBuffer, packetLen, kissEncoded);
    (void)KissSerial.write(kissEncoded.data(), kissEncoded.size()); // ignore return value
    // if(sent != kissEncoded.size()) { DebugSerial.println("! WARN: Serial write incomplete"); } // Optional check
}
#if BLUETOOTH_CLASSIC_AVAILABLE
void InterfaceManager::sendPacketViaBluetooth(const uint8_t *packetBuffer, size_t packetLen) {
    if (!_serialBT.connected()) return;
    std::vector<uint8_t> kissEncoded;
    KISSProcessor::encode(packetBuffer, packetLen, kissEncoded);
    size_t sent = _serialBT.write(kissEncoded.data(), kissEncoded.size());
     // if(sent != kissEncoded.size()) { DebugSerial.println("! WARN: Bluetooth write incomplete"); } // Optional check
}
#endif

// --- ESP-NOW Peer Management ---
void InterfaceManager::enableEspNow() {
    if (_espNowInitialized) {
        DebugSerial.println("IF: ESP-NOW already enabled.");
        return;
    }
    // Ensure WiFi radio is in STA mode
    if (WiFi.getMode() == WIFI_OFF) {
        WiFi.mode(WIFI_STA);
        esp_wifi_set_ps(WIFI_PS_NONE);
    }
    setupESPNow();
}

void InterfaceManager::disableEspNow() {
    if (!_espNowInitialized) {
        DebugSerial.println("IF: ESP-NOW already disabled.");
        return;
    }
    esp_now_deinit();
    _espNowPeers.clear();
    _espNowInitialized = false;
    DebugSerial.println("IF: ESP-NOW disabled.");
}

bool InterfaceManager::addEspNowPeer(const uint8_t* mac_addr) {
    if (!mac_addr || !_espNowInitialized) return false;
    if (checkEspNowPeer(mac_addr)) {
        // ensure our list also contains it
        std::array<uint8_t,6> arr;
        memcpy(arr.data(), mac_addr, 6);
        if (std::find(_espNowPeers.begin(), _espNowPeers.end(), arr) == _espNowPeers.end()) {
            _espNowPeers.push_back(arr);
        }
        return true; // Already exists at driver level
    }

    esp_now_peer_info_t peerInfo = {}; // Initialize all fields to 0/false/etc.
    memcpy(peerInfo.peer_addr, mac_addr, 6);
    // peerInfo.channel = 0; // Use current channel by default
    peerInfo.encrypt = false; // Encryption disabled (requires shared keys)
    // Try adding peer. On some IDF/Arduino builds the driver requires the ifidx
    // (station vs softAP) to be set. Try without ifidx first, then retry with
    // WIFI_IF_STA if the first attempt fails.
    esp_err_t add_result = esp_now_add_peer(&peerInfo);
    if (add_result != ESP_OK) {
         DebugSerial.print("! WARN: esp_now_add_peer() initial attempt failed for "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(add_result));
         // Retry with explicit interface index
         peerInfo.ifidx = WIFI_IF_STA;
         add_result = esp_now_add_peer(&peerInfo);
         if (add_result != ESP_OK) {
             DebugSerial.print("! ERROR: Failed to add ESP-NOW peer after retry "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(add_result));
             return false;
         } else {
             DebugSerial.println("IF: esp_now_add_peer succeeded on retry with WIFI_IF_STA");
         }
    }
    DebugSerial.print("IF: Added ESP-NOW peer: "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.println();
    // record in our local list
    {
        std::array<uint8_t,6> arr;
        memcpy(arr.data(), mac_addr, 6);
        _espNowPeers.push_back(arr);
    }
    return true;
}

bool InterfaceManager::removeEspNowPeer(const uint8_t* mac_addr) {
     if (!mac_addr || !_espNowInitialized) return false;
     if (!checkEspNowPeer(mac_addr)) return false; // Not found

     esp_err_t del_result = esp_now_del_peer(mac_addr);
     if (del_result != ESP_OK) {
         DebugSerial.print("! WARN: Failed to delete ESP-NOW peer "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(esp_err_to_name(del_result));
         return false;
     }
     DebugSerial.print("IF: Removed ESP-NOW peer: "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.println();
     // remove from our vector as well
     std::array<uint8_t,6> arr;
     memcpy(arr.data(), mac_addr, 6);
     auto it = std::find(_espNowPeers.begin(), _espNowPeers.end(), arr);
     if (it != _espNowPeers.end()) _espNowPeers.erase(it);
     return true;
}

bool InterfaceManager::checkEspNowPeer(const uint8_t* mac_addr) {
    if (!mac_addr || !_espNowInitialized) return false;
    // esp_now_is_peer_exist() is deprecated/removed in later IDF versions.
    // Use esp_now_get_peer() and check result.
    esp_now_peer_info_t peer_info;
    return (esp_now_get_peer(mac_addr, &peer_info) == ESP_OK);
    // return esp_now_is_peer_exist(mac_addr); // Older IDF versions
}


// --- Debug Helpers ---
void InterfaceManager::printEspNowPeers() {
    DebugSerial.println("IF: ESP-NOW peer list:");
    if (_espNowPeers.empty()) {
        DebugSerial.println("  (none)");
        return;
    }
    for (const auto &addr : _espNowPeers) {
        DebugSerial.print("  "); Utils::printBytes(addr.data(), 6, DebugSerial); DebugSerial.println();
    }
}

// --- Static Callbacks ---
// ESP-IDF v5 changed the callback signature to esp_now_recv_info_t.
#if defined(ESP_IDF_VERSION_MAJOR) && (ESP_IDF_VERSION_MAJOR >= 5)
void InterfaceManager::staticEspNowRecvCallback(const esp_now_recv_info_t *recv_info, const uint8_t *incomingData, int len) {
    const uint8_t* mac_addr = (recv_info != nullptr) ? recv_info->src_addr : nullptr;
#else
void InterfaceManager::staticEspNowRecvCallback(const uint8_t *mac_addr, const uint8_t *incomingData, int len) {
#endif
    if (_instance && _instance->_packetReceiver && mac_addr && incomingData && len > 0) {
        if (len <= MAX_PACKET_SIZE) {
             DebugSerial.print("[ESP-NOW RX] "); DebugSerial.print(len); DebugSerial.print("B from ");
             Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.println();
             // Pass to instance's packet receiver callback
            _instance->_packetReceiver(incomingData, (size_t)len, InterfaceType::ESP_NOW, mac_addr, IPAddress(), 0);
        } else {
             DebugSerial.print("! WARN: Oversized ESP-NOW packet received ("); DebugSerial.print(len); DebugSerial.println(" bytes), discarding.");
        }
    }
}

/* Optional Static Send Callback
void InterfaceManager::staticEspNowSendCallback(const uint8_t *mac_addr, esp_now_send_status_t status) {
    if (_instance && mac_addr) {
        // Could notify routing table or link manager about send status
        // DebugSerial.print("IF: ESP-NOW Send Status to MAC "); Utils::printBytes(mac_addr, 6, DebugSerial); DebugSerial.print(": "); DebugSerial.println(status == ESP_NOW_SEND_SUCCESS ? "Success" : "Fail");
    }
}
*/

